src/InformationRegisters/ОчередьСообщенийИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОчередьСообщенийИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеСообщенийИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияУправленияЗаказами</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииУправленияЗаказамиИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремаркировкаТоваровИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеКодовМаркировкиИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодключениеКегаКОборудованиюРозливаИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтгрузкаТоваровИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратВОборотИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыводИзОборотаИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.УточнениеСведенийОКодахМаркировкиИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитыИсходящегоСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПротоколОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПоследнегоБлокаКодов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагружатьПосле</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИСМППрисоединенныеФайлы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагружатьДо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИСМППрисоединенныеФайлы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаМодификацииУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ДанныеКлючаСессииИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКлючаСессииИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяПараметраСеанса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НапоминанияПользователяИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НапоминанияПользователяИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиУчетаМаркируемойПродукцииИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаМаркируемойПродукцииИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВестиУчетПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбязательнойМаркировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбязательногоВключенияРазрешительногоРежима</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СостоянияCDNПлощадокИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияCDNПлощадокИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СреднееВремяПроверкиКМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднееВремяОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНедоступнаДоУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновленияУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АдресПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтатусыДокументовИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументовИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиВозвратаВОборотИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиПеремаркировкиТоваровИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиВыводаИзОборотаИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиПриемкиТоваровИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиСписанияКодовМаркировкиИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиПодключениеКОборудованиюРозливаИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиОтчетаИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиОтгрузкиТоваровИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиУточненияСведенийОКодахМаркировкиИСМП</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиМаркировкиТоваровИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие2</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие3</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияПоВзаимодействиюИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремаркировкаТоваровИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеКодовМаркировкиИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодключениеКегаКОборудованиюРозливаИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтгрузкаТоваровИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратВОборотИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыводИзОборотаИСМП</v8:Type>
						<v8:Type>cfg:DocumentRef.УточнениеСведенийОКодахМаркировкиИСМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыТокеновАвторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыТокеновАвторизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СУЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИСМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИСМПРозница</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещениеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТокенаАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТокеновАвторизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответственные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВСекундах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ИнтеграцияИСМПВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДлительныеОперации

// Подготавливает сообщения к передаче в сервис ИСМП.
//
// Параметры:
//  ВходящиеДанные - Массив Из (См. ИнтерфейсИСМПКлиентСервер.ПараметрыОбработкиДокументов)
//  УникальныйИдентификатор - УникальныйИдентификатор - Уникальный идентификатор формы.
// 
// Возвращаемое значение:
//  Структура - см. функцию ПодготовитьСообщенияКПередаче().
//
Функция ПодготовитьКПередаче(ВходящиеДанные, УникальныйИдентификатор = Неопределено) Экспорт
	
	Организации = Неопределено;
	
	ПараметрыОбмена = ИнтеграцияИСМП.ПараметрыОбмена(Организации, УникальныйИдентификатор);
	
	Если УникальныйИдентификатор <> Неопределено И Не ИнтеграцияИС.РежимРаботыБезФоновыхЗаданий() Тогда
		
		ВозвращаемоеЗначение = Новый Структура;
		ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Неопределено);
		ВозвращаемоеЗначение.Вставить("ДоступныеСертификаты",           Неопределено);
		ВозвращаемоеЗначение.Вставить("ТребуетсяПодписание",            Неопределено);
		ВозвращаемоеЗначение.Вставить("КОпределениюВидаУпаковки",       Неопределено);
		ВозвращаемоеЗначение.Вставить("Изменения",                      Новый Массив);
		ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",             Неопределено);
		ВозвращаемоеЗначение.Вставить("Ожидать",                        Неопределено);
		ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище",      Неопределено);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение обмена с ИС МП'");
		
		ПараметрыФоновогоЗадания = Новый Структура;
		ПараметрыФоновогоЗадания.Вставить("ВходящиеДанные",    ВходящиеДанные);
		ПараметрыФоновогоЗадания.Вставить("ПараметрыОбмена",   ПараметрыОбмена);
		ПараметрыФоновогоЗадания.Вставить("ПараметрыСеансаИС", ИнтеграцияИСМПСлужебный.ПараметрыСеансаИС());
		
		ИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
		
		ВозвращаемоеЗначение.ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
			"ИнтеграцияИСМПСлужебный.ПодготовитьКПередачеДлительнаяОперация",
			ПараметрыФоновогоЗадания, ПараметрыВыполнения);
		
	Иначе
		
		ВозвращаемоеЗначение = ИнтеграцияИСМПСлужебный.ПодготовитьКПередачеУниверсально(ВходящиеДанные, ПараметрыОбмена);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Подготавливает сообщения к передаче в сервис ИСМП.
//
// Параметры:
//  ПараметрыЗагрузки - Структура - Структура со свойствами:
//   * Организация - ОпределяемыйТип.Организация - Организация
//   * Интервал - Структура - Структура со свойствами:
//     ** НачалоПериода - Дата - Дата начала периода.
//     ** КонецПериода - Дата - Дата окончания периода.
//  УникальныйИдентификатор - УникальныйИдентификатор - Уникальный идентификатор формы.
// 
// Возвращаемое значение:
//  Структура - см. функцию ПодготовитьСообщенияКПередаче().
//
Функция ЗагрузитьВходящиеДокументы(ПараметрыЗагрузки, УникальныйИдентификатор = Неопределено) Экспорт
	
	ПараметрыОбмена = ИнтеграцияИСМП.ПараметрыОбмена(ПараметрыЗагрузки.Организация, УникальныйИдентификатор);
	
	Если УникальныйИдентификатор <> Неопределено И Не ИнтеграцияИС.РежимРаботыБезФоновыхЗаданий() Тогда
		
		ВозвращаемоеЗначение = Новый Структура;
		ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Неопределено);
		ВозвращаемоеЗначение.Вставить("ДоступныеСертификаты",           Неопределено);
		ВозвращаемоеЗначение.Вставить("ТребуетсяПодписание",            Неопределено);
		ВозвращаемоеЗначение.Вставить("КОпределениюВидаУпаковки",       Неопределено);
		ВозвращаемоеЗначение.Вставить("Изменения",                      Новый Массив);
		ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",             Неопределено);
		ВозвращаемоеЗначение.Вставить("Ожидать",                        Неопределено);
		ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище",      Неопределено);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка входящих документов из ИС МП'");
		
		ПараметрыФоновогоЗадания = Новый Структура;
		ПараметрыФоновогоЗадания.Вставить("ПараметрыЗагрузки", ПараметрыЗагрузки);
		ПараметрыФоновогоЗадания.Вставить("ПараметрыОбмена",   ПараметрыОбмена);
		ПараметрыФоновогоЗадания.Вставить("ПараметрыСеансаИС", ИнтеграцияИСМПСлужебный.ПараметрыСеансаИС());
		
		ИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
		
		ВозвращаемоеЗначение.ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
			"ИнтеграцияИСМПСлужебный.ЗагрузитьВходящиеДокументыДлительнаяОперация",
			ПараметрыФоновогоЗадания, ПараметрыВыполнения);
		
	Иначе
		
		ВозвращаемоеЗначение = ИнтеграцияИСМПСлужебный.ЗагрузитьВходящиеДокументыУниверсально(ПараметрыЗагрузки, ПараметрыОбмена);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ВыполнитьОбмен(Организации = Неопределено, УникальныйИдентификатор = Неопределено, СообщениеИлиДокумент = Неопределено) Экспорт
	
	ПараметрыОбмена = ИнтеграцияИСМП.ПараметрыОбмена(Организации, УникальныйИдентификатор);
	
	ИнтеграцияИСМПСлужебный.ПостроитьОчередьСообщений(ПараметрыОбмена, СообщениеИлиДокумент);
	
	Если УникальныйИдентификатор <> Неопределено И Не ИнтеграцияИС.РежимРаботыБезФоновыхЗаданий() Тогда
		
		ВозвращаемоеЗначение = Новый Структура;
		ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Неопределено);
		ВозвращаемоеЗначение.Вставить("ДоступныеСертификаты",           Неопределено);
		ВозвращаемоеЗначение.Вставить("ТребуетсяПодписание",            Неопределено);
		ВозвращаемоеЗначение.Вставить("КОпределениюВидаУпаковки",       Неопределено);
		ВозвращаемоеЗначение.Вставить("Изменения",                      Новый Массив);
		ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",             Неопределено);
		ВозвращаемоеЗначение.Вставить("Ожидать",                        Неопределено);
		ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище",      Неопределено);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение обмена с ИС МП'");
		
		ПараметрыФоновогоЗадания = Новый Структура;
		ПараметрыФоновогоЗадания.Вставить("ПараметрыОбмена",   ПараметрыОбмена);
		ПараметрыФоновогоЗадания.Вставить("ПараметрыСеансаИС", ИнтеграцияИСМПСлужебный.ПараметрыСеансаИС());
		
		ИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
		
		ВозвращаемоеЗначение.ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
			"ИнтеграцияИСМПСлужебный.ВыполнитьОбменДлительнаяОперация",
			ПараметрыФоновогоЗадания, ПараметрыВыполнения);
		
	Иначе
		
		ВозвращаемоеЗначение = ИнтеграцияИСМПСлужебный.ВыполнитьОбменУниверсально(ПараметрыОбмена);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ПродолжитьВыполнениеОбмена(ПодписанныеДанныеПоОрганизациям, АдресВоВременномХранилище) Экспорт
	
	ПараметрыОбмена = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	// Установка параметров сеанса выполняется НЕ в фоновом задании.
	ТребуетсяЗапроситьУстановитьКлючСессии = Неопределено;
	ПодписанныеСообщенияПоОрганизациям     = Неопределено;
	Если ПодписанныеДанныеПоОрганизациям <> Неопределено Тогда
		Для Каждого КлючИЗначение Из ПодписанныеДанныеПоОрганизациям Цикл
			
			Организация = КлючИЗначение.Ключ;
			Сообщения   = КлючИЗначение.Значение;
			
			ЗапроситьУстановитьКлючСессии = Новый Массив;
			ПодписанныеСообщения          = Новый Массив;
			
			Для Каждого Сообщение Из Сообщения Цикл
				Если Сообщение.Свойство("ПараметрыАвторизации") Тогда
					ЗапроситьУстановитьКлючСессии.Добавить(Сообщение);
				Иначе
					ПодписанныеСообщения.Добавить(Сообщение);
				КонецЕсли;
				Если ЭтоАдресВременногоХранилища(Сообщение.СвойстваПодписи) Тогда
					Сообщение.СвойстваПодписи = ПолучитьИзВременногоХранилища(Сообщение.СвойстваПодписи);
				КонецЕсли;
			КонецЦикла;
			
			Если ЗапроситьУстановитьКлючСессии.Количество() > 0 Тогда
				Если ТребуетсяЗапроситьУстановитьКлючСессии = Неопределено Тогда
					ТребуетсяЗапроситьУстановитьКлючСессии = Новый Соответствие;
				КонецЕсли;
				ТребуетсяЗапроситьУстановитьКлючСессии.Вставить(Организация, ЗапроситьУстановитьКлючСессии);
			КонецЕсли;
			
			Если ПодписанныеСообщения.Количество() > 0 Тогда
				Если ПодписанныеСообщенияПоОрганизациям = Неопределено Тогда
					ПодписанныеСообщенияПоОрганизациям = Новый Соответствие;
				КонецЕсли;
				ПодписанныеСообщенияПоОрганизациям.Вставить(Организация, ПодписанныеСообщения);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	ИнтеграцияИСМПСлужебный.ЗапроситьУстановитьКлючСессии(
		ТребуетсяЗапроситьУстановитьКлючСессии,
		ПодписанныеСообщенияПоОрганизациям,
		ПараметрыОбмена);
	
	// В процессе установки ключа сессии могли произойти ошибки.
	Для Каждого ЭлементОчереди Из ПараметрыОбмена.ОбработанныеЭлементыОчереди Цикл
		Если ПараметрыОбмена.ОчередьСообщений.Индекс(ЭлементОчереди) <> -1 Тогда
			ПараметрыОбмена.ОчередьСообщений.Удалить(ЭлементОчереди);
		КонецЕсли;
	КонецЦикла;
	ПараметрыОбмена.ОбработанныеЭлементыОчереди.Очистить();
	
	Если ПараметрыОбмена.УникальныйИдентификатор <> Неопределено
		И Не ИнтеграцияИС.РежимРаботыБезФоновыхЗаданий() Тогда
		
		ВозвращаемоеЗначение = Новый Структура;
		ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии", Неопределено);
		ВозвращаемоеЗначение.Вставить("ДоступныеСертификаты",           Неопределено);
		ВозвращаемоеЗначение.Вставить("ТребуетсяПодписание",            Неопределено);
		ВозвращаемоеЗначение.Вставить("КОпределениюВидаУпаковки",       Неопределено);
		ВозвращаемоеЗначение.Вставить("Изменения",                      Новый Массив);
		ВозвращаемоеЗначение.Вставить("ДлительнаяОперация",             Неопределено);
		ВозвращаемоеЗначение.Вставить("Ожидать",                        Неопределено);
		ВозвращаемоеЗначение.Вставить("АдресВоВременномХранилище",      Неопределено);
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ПараметрыОбмена.УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение обмена с ИС МП'");
		
		ПараметрыФоновогоЗадания = Новый Структура;
		ПараметрыФоновогоЗадания.Вставить("ПодписанныеСообщенияПоОрганизациям", ПодписанныеСообщенияПоОрганизациям);
		ПараметрыФоновогоЗадания.Вставить("ПараметрыОбмена",                    ПараметрыОбмена);
		ПараметрыФоновогоЗадания.Вставить("ПараметрыСеансаИС",                  ИнтеграцияИСМПСлужебный.ПараметрыСеансаИС());
		
		ИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
		
		ВозвращаемоеЗначение.ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
			"ИнтеграцияИСМПСлужебный.ПродолжитьВыполнениеОбменаДлительнаяОперация",
			ПараметрыФоновогоЗадания, ПараметрыВыполнения);
		
	Иначе
		
		ВозвращаемоеЗначение = ИнтеграцияИСМПСлужебный.ПродолжитьВыполнениеОбменаУниверсально(
			ПодписанныеСообщенияПоОрганизациям, ПараметрыОбмена);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

// Запуск в фоне актуализации списка и скорости отклика CDN-площадок
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, от имени которой выполняется запрос к ГИС МТ
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Уникальный идентификатор формы
//  ОбновлятьБезПроверкиДатыОбновления - Булево - если Истина, то запускается процедура обновления списка вне зависимости от даты актуальности
//   В противном случае обновление будет вызвано только если прошел срок актуальности загрузки площадок
// 
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьВФоне.
Функция ЗапуститьОбновлениеCDNПлощадок(Организация, УникальныйИдентификатор = Неопределено, ОбновлятьБезПроверкиДатыОбновления = Ложь) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление CDN-площадок'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("Организация",                        Организация);
	ПараметрыФоновогоЗадания.Вставить("ПараметрыЛогированияЗапросовИСМП",   ПараметрыСеанса.ПараметрыЛогированияЗапросовИСМП);
	ПараметрыФоновогоЗадания.Вставить("ОбновлятьБезПроверкиДатыОбновления", ОбновлятьБезПроверкиДатыОбновления);
	
	ИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияИСМПСлужебный.ВыполнитьАктуализациюCDNПлощадокДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

// Запуск в фоне заполнения настроек разрешительного режима - аналогично обработчику обновления, но при включении новой товарной группы, 
// если на момент обновления таковых не велось
// 
// Параметры:
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Уникальный идентификатор формы
// 
// Возвращаемое значение:
//  см. ДлительныеОперации.ВыполнитьВФоне.
Функция ЗапуститьЗаполнениеНастроекРазрешительногоРежима(УникальныйИдентификатор = Неопределено) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Первичная настройка разрешительного режима'");
	
	ПараметрыФоновогоЗадания = Новый Структура;
	ПараметрыФоновогоЗадания.Вставить("ПараметрыЛогированияЗапросовИСМП", ПараметрыСеанса.ПараметрыЛогированияЗапросовИСМП);
	
	ИнтеграцияИСПереопределяемый.НастроитьДлительнуюОперацию(ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияИСМПСлужебный.ВыполнитьОбновлениеНастроекДляРазрешительногоРежимаДлительнаяОперация",
		ПараметрыФоновогоЗадания, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти

// Удаляет неотправленную операцию из очереди передачи данных в ИС МП.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - документ, по которому требуется отменить передачу данных.
//
// Возвращаемое значение:
//  Массив - Массив структур, см. функцию ИнтеграцияИСМПСлужебный.СтруктураИзменения(), или Неопределено (если в очереди нет сообщений).
//
Функция ОтменитьПередачу(ДокументСсылка) Экспорт
	
	ОчередьСообщений = РегистрыСведений.ОчередьСообщенийИСМП.ОчередьСообщенийПоДокументу(ДокументСсылка);
	
	Если ОчередьСообщений.Количество() = 0 Тогда
		
		ВосстановитьСтатусДокументаПоДаннымПротоколаОбмена(ДокументСсылка);
		Возврат ЗаполнитьИзменения(ДокументСсылка);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстОшибки = "";
	
	НачатьТранзакцию();
	Попытка
		
		Для Каждого ЭлементОчереди Из ОчередьСообщений Цикл
			НаборЗаписей = РегистрыСведений.ОчередьСообщенийИСМП.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Сообщение.Установить(ЭлементОчереди.Сообщение, Истина);
			НаборЗаписей.Записать();
		КонецЦикла;
		
		НовыйСтатус = ВосстановитьСтатусДокументаПоДаннымПротоколаОбмена(ДокументСсылка, ЭлементОчереди.Сообщение);
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ИнтеграцияИСМПСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЗаполнитьИзменения(ДокументСсылка, ЭлементОчереди, ТекстОшибки, НовыйСтатус);
	
КонецФункции

// Отменяет последнюю операцию (например, если возникла ошибка передачи данных).
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - документ, по которому требуется отменить операцию.
//
// Возвращаемое значение:
//  Массив - Массив структур, см. функцию ИнтеграцияИСМПСлужебный.СтруктураИзменения().
//
Функция ОтменитьПоследнююОперацию(ДокументСсылка) Экспорт
	
	ДанныеПоследнегоСообщения = Справочники.ИСМППрисоединенныеФайлы.ПоследнееСообщение(ДокументСсылка, "Передано");
	
	Если ДанныеПоследнегоСообщения = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстОшибки = "";
	Попытка
		НовыйСтатус = ВосстановитьСтатусДокументаПоДаннымПротоколаОбмена(ДокументСсылка, ДанныеПоследнегоСообщения.Сообщение);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ИнтеграцияИСМПСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЗаполнитьИзменения(ДокументСсылка, ДанныеПоследнегоСообщения, ТекстОшибки, НовыйСтатус);
	
КонецФункции

#Область ОтветственныеЗаАктуализациюТокеновАвторизации

// Получает настройки текущего пользователя для актуализации токенов авторизации.
// 
// Параметры:
//  ДляПросмотра - Булево - определяет для чего нужно получить настройки:
//                          для просмотра списка токенов или для актуализации токенов.
// 
// Возвращаемое значение:
// см. Справочники.ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП.НастройкиОтветственногоЗаАктуализациюТокеновАвторизации.
//
Функция НастройкиОтветственногоЗаАктуализациюТокеновАвторизации(ДляПросмотра) Экспорт
	
	Возврат Справочники.ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП.НастройкиОтветственногоЗаАктуализациюТокеновАвторизации(ДляПросмотра);
	
КонецФункции

// Получает напоминания пользователю, ответственному за актуализацию токенов авторизации.
//
// Параметры:
//  Настройки - см. Справочники.ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП.НастройкиОтветственногоЗаАктуализациюТокеновАвторизации.
// 
// Возвращаемое значение:
//  Массив из Структура:
//   * ТипТокенаАвторизации - ПеречислениеСсылка.ТипыТокеновАвторизации - тип токена авторизации.
//   * Организация - ОпределяемыйТип.Организация - организация.
//   * ПроизводственныйОбъект - ОпределяемыйТип.ПроизводственныйОбъектИС - производственный объект.
//   * ДатаДействия - Дата - дата и время, до которой действителен токен.
//   * ВремяДействия - Число - сколько времени (в секундах, кратно минутам) осталось до окончания действия токена.
//   * Отсутствует - Булево - Истина, если токен отсутствует.
//   * Просрочен - Булево - Истина, если токен имеется, но дата действия токена больше текущей.
//   * ТребуетсяАктуализация - Булево - Истина, если требуется актуализация токена.
//   * ОповещениеИспользуется - Булево - Истина, если требуется оповещение пользователя о скором окончании действия токена.
//   * ОповещатьЗа - Число - время в секундах до истечения действия токена, за которое необходимо оповестить пользователя.
//   * ОповеститьЧерез - Число - время в секундах до момента ближайшего оповещения пользователя.
//
Функция ПолучитьНапоминанияОтветственномуЗаАктуализациюТокеновАвторизации(Настройки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяПараметраСУЗ         = ИнтерфейсИСМПКлиентСервер.ИмяДанныхКлючаСессии(Перечисления.ТипыТокеновАвторизации.СУЗ);
	ИмяПараметраИСМП        = ИнтерфейсИСМПКлиентСервер.ИмяДанныхКлючаСессии(Перечисления.ТипыТокеновАвторизации.ИСМП);
	ИмяПараметраИСМПРозница = ИнтерфейсИСМПКлиентСервер.ИмяДанныхКлючаСессии(Перечисления.ТипыТокеновАвторизации.ИСМПРозница);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь",            Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("ИмяПараметраИСМП",        ИмяПараметраИСМП);
	Запрос.УстановитьПараметр("ИмяПараметраСУЗ",         ИмяПараметраСУЗ);
	Запрос.УстановитьПараметр("ИмяПараметраИСМПРозница", ИмяПараметраИСМПРозница);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИмяПараметраСеанса,
	|	Данные
	|ИЗ
	|	РегистрСведений.ДанныеКлючаСессииИСМП
	|ГДЕ
	|	ИмяПараметраСеанса = &ИмяПараметраИСМП
	|	ИЛИ ИмяПараметраСеанса = &ИмяПараметраСУЗ
	|	ИЛИ ИмяПараметраСеанса = &ИмяПараметраИСМПРозница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СрокНапоминания
	|ИЗ
	|	РегистрСведений.НапоминанияПользователяИСМП
	|ГДЕ
	|	Пользователь = &Пользователь";
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТекущаяДата = ТекущаяУниверсальнаяДата();
	ПустаяДата  = Дата(1,1,1);
	
	ДанныеКлючаСессииСУЗ         = Неопределено;
	ДанныеКлючаСессииИСМП        = Неопределено;
	ДанныеКлючаСессииИСМПРозница = Неопределено;
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИмяПараметраСеанса = ИмяПараметраИСМП Тогда
			ДанныеКлючаСессииИСМП = Выборка.Данные.Получить();
		ИначеЕсли Выборка.ИмяПараметраСеанса = ИмяПараметраИСМПРозница Тогда
			ДанныеКлючаСессииИСМПРозница = Выборка.Данные.Получить();
		ИначеЕсли Выборка.ИмяПараметраСеанса = ИмяПараметраСУЗ Тогда
			ДанныеКлючаСессииСУЗ = Выборка.Данные.Получить();
		КонецЕсли;
	КонецЦикла;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Если Выборка.Следующий() Тогда
		СрокНапоминания = Выборка.СрокНапоминания;
	Иначе
		СрокНапоминания = ПустаяДата;
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Для Каждого Настройка Из Настройки Цикл
		
		ТипТокенаАвторизации   = Настройка.ТипТокенаАвторизации;
		Организация            = Настройка.Организация;
		ПроизводственныйОбъект = Настройка.ПроизводственныйОбъект;
		ОповещатьЗа            = Настройка.ВремяОповещения;
		
		Если ТипТокенаАвторизации = Перечисления.ТипыТокеновАвторизации.СУЗ Тогда
			Если ДанныеКлючаСессииСУЗ = Неопределено
				Или ДанныеКлючаСессииСУЗ[Организация] = Неопределено
				Или ДанныеКлючаСессииСУЗ[Организация][ПроизводственныйОбъект] = Неопределено Тогда
				ДатаДействияТокена = ПустаяДата;
			Иначе
				ДатаДействияТокена = ДанныеКлючаСессииСУЗ[Организация][ПроизводственныйОбъект].ДействуетДо;
			КонецЕсли;
		ИначеЕсли ТипТокенаАвторизации = Перечисления.ТипыТокеновАвторизации.ИСМПРозница Тогда
			Если ДанныеКлючаСессииИСМПРозница = Неопределено
				Или ДанныеКлючаСессииИСМПРозница[Организация] = Неопределено Тогда
				ДатаДействияТокена = ПустаяДата;
			Иначе
				ДатаДействияТокена = ДанныеКлючаСессииИСМПРозница[Организация].ДействуетДо;
			КонецЕсли;
		Иначе
			Если ДанныеКлючаСессииИСМП = Неопределено
				Или ДанныеКлючаСессииИСМП[Организация] = Неопределено Тогда
				ДатаДействияТокена = ПустаяДата;
			Иначе
				ДатаДействияТокена = ДанныеКлючаСессииИСМП[Организация].ДействуетДо;
			КонецЕсли;
		КонецЕсли;
		
		ТокенОтсутствует = ДатаДействияТокена = ПустаяДата;
		
		Если ТокенОтсутствует Тогда
			ВремяДействияТокена = 0;
		Иначе
			ВремяДействияТокена = ДатаДействияТокена - ТекущаяДата;
			Если ВремяДействияТокена < 0 Тогда
				ВремяДействияТокена = 0;
			Иначе
				ВремяДействияТокена = Цел(ВремяДействияТокена / 60) * 60;
			КонецЕсли;
		КонецЕсли;
		
		ТокенПросрочен = Не ТокенОтсутствует И ВремяДействияТокена = 0;
		
		ТребуетсяАктуализацияТокена = ТокенОтсутствует
			Или ТокенПросрочен
			Или ВремяДействияТокена <= ОповещатьЗа И СрокНапоминания <= ТекущаяДата;
		
		ОповещениеИспользуется = ОповещатьЗа > 0;
		
		ОповеститьЧерез = 0;
		Если ОповещениеИспользуется Тогда
			Если ВремяДействияТокена > ОповещатьЗа Тогда
				ОповеститьЧерез = ВремяДействияТокена - ОповещатьЗа;
			ИначеЕсли СрокНапоминания > ТекущаяДата Тогда
				ОповеститьЧерез = СрокНапоминания - ТекущаяДата;
			КонецЕсли;
		КонецЕсли;
		
		Данные = Новый Структура;
		Данные.Вставить("ТипТокенаАвторизации",   ТипТокенаАвторизации);
		Данные.Вставить("Организация",            Организация);
		Данные.Вставить("ПроизводственныйОбъект", ПроизводственныйОбъект);
		Данные.Вставить("ДатаДействия",           ДатаДействияТокена);
		Данные.Вставить("ВремяДействия",          ВремяДействияТокена);
		Данные.Вставить("Отсутствует",            ТокенОтсутствует);
		Данные.Вставить("Просрочен",              ТокенПросрочен);
		Данные.Вставить("ТребуетсяАктуализация",  ТребуетсяАктуализацияТокена);
		Данные.Вставить("ОповещениеИспользуется", ОповещениеИспользуется);
		Данные.Вставить("ОповещатьЗа",            ОповещатьЗа);
		Данные.Вставить("ОповеститьЧерез",        ОповеститьЧерез);
		
		Результат.Добавить(Данные);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область НастройкиУчета

// Возвращает признак ведения учета маркируемой продукции.
// 
// Возвращаемое значение:
// 	Булево - Истина, если учет маркируемой продукции используется.
//
Функция ИспользуетсяМаркируемаяПродукция() Экспорт
	
	Возврат ИнтеграцияИСМП.ИспользуетсяМаркируемаяПродукция();
	
КонецФункции

// Возвращает дату обязательной маркировки маркируемой продукци переданного вида.
// 
// Параметры:
//  ВидМаркируемойПродукции - ПеречислениеСсылка.ВидыПродукцииИС - вид маркируемой продукции
// Возвращаемое значение:
// 	Дата - дата обязательной маркировки маркируемой продукции.
//
Функция ДатаОбязательнойМаркировкиПродукции(ВидМаркируемойПродукции) Экспорт
	
	ДатаОбязательнойМаркировки = '00010101';
	
	ТекстЗапроса = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДатаОбязательнойМаркировки КАК ДатаОбязательнойМаркировки
	|ИЗ
	|	РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП
	|ГДЕ
	|	ВидПродукции = &ВидМаркируемойПродукции
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВидМаркируемойПродукции", ВидМаркируемойПродукции);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ДатаОбязательнойМаркировки = Выборка.ДатаОбязательнойМаркировки;
	КонецЕсли;
	
	Возврат ДатаОбязательнойМаркировки;

КонецФункции

// Возвращает признак ведения учета маркируемой продукци переданного вида.
// 
// Параметры:
//  ВидМаркируемойПродукции - ПеречислениеСсылка.ВидыПродукцииИС - вид маркируемой продукции
// Возвращаемое значение:
// 	Булево - признак ведения учета маркируемой продукции переданного вида.
//
Функция ВестиУчетМаркируемойПродукции(ВидМаркируемойПродукции = Неопределено) Экспорт
	
	Если ВидМаркируемойПродукции = Неопределено Тогда
		
		Возврат ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП");

	ИначеЕсли ВидМаркируемойПродукции = Перечисления.ВидыПродукцииИС.ПустаяСсылка() Тогда
		
		Возврат ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП");
		
	ИначеЕсли ИнтеграцияИСПовтИсп.ЭтоПродукцияИСМП(ВидМаркируемойПродукции, Истина) Тогда
		
		Если ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП") Тогда
			ТекстЗапроса = "
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВестиУчетПродукции КАК ВестиУчетПродукции
			|ИЗ
			|	РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП
			|ГДЕ
			|	ВидПродукции = &ВидМаркируемойПродукции
			|";
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("ВидМаркируемойПродукции", ВидМаркируемойПродукции);
			
			Результат = Запрос.Выполнить();
			
			Если Результат.Пустой() Тогда
				Возврат Ложь;
			Иначе
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				Возврат Выборка.ВестиУчетПродукции;
			КонецЕсли;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

//Возвращает учитываемые виды маркируемой продукции.
//  При вызове с параметрами -только находящиеся в тестовом/обязательном периоде эксплуатации.
//
//Параметры:
//   НаДату - Неопределено - все учитываемые
//          - Дата - требуется получение только видов продукции в тестовом/обязательном периоде на указанную дату
//   ТестовыйПериод - Булево - признак тестового периода
//
// Возвращаемое значение:
//   ФиксированныйМассив Из Перечислениессылка.ВидыПродукцииИС - учитываемые виды маркируемой продукции.
//
Функция УчитываемыеВидыМаркируемойПродукции(НаДату = Неопределено, ТестовыйПериод = Ложь) Экспорт
	
	ВидыПродукции = Новый Массив;
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетМаркируемойПродукцииИСМП") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Настройки.ВидПродукции КАК ВидПродукции,
		|	Настройки.ДатаОбязательнойМаркировки КАК ДатаОбязательнойМаркировки
		|ИЗ
		|	РегистрСведений.НастройкиУчетаМаркируемойПродукцииИСМП КАК Настройки
		|ГДЕ
		|	Настройки.ВестиУчетПродукции";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НаДату = Неопределено Тогда
				ВидыПродукции.Добавить(Выборка.ВидПродукции);
			ИначеЕсли ТестовыйПериод = (НаДату < Выборка.ДатаОбязательнойМаркировки) Тогда
				ВидыПродукции.Добавить(Выборка.ВидПродукции);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(ВидыПродукции);
	
КонецФункции

// Возвращает виды продукции, по которым доступно заполнение документа ИСМП
//
// Параметры:
//   ПолноеИмяДокумента - Строка - создаваемый вводом на основании документ
//   Ссылка - ОпределяемыйТип.ОснованиеСтатусыОформленияДокументовИСМП - документ по которому происходит обработка заполнения
//
// Возвращаемое значение:
//   Массив Из ПеречислениеСсылка.ВидыПродукцииИС - различные виды продукции в документе ИСМП, заполненном 
//     по основанию без фильтра по виду продукции.
Функция ВидыПродукцииДанныхЗаполнения(ПолноеИмяДокумента, Ссылка) Экспорт
	
	ДоступныеВидыПродукции = Новый Массив;
	
	Если НЕ ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции() Тогда
		Возврат ДоступныеВидыПродукции;
	КонецЕсли;
	
	ВидыПродукцииИСМП = ИнтеграцияИСКлиентСервер.ВидыПродукцииИСМП(Истина);
	Для Каждого ВидПродукцииИСМП Из ВидыПродукцииИСМП Цикл
		Если ИнтеграцияИСМПКлиентСерверПовтИсп.ВестиУчетМаркируемойПродукции(ВидПродукцииИСМП) Тогда
			ДоступныеВидыПродукции.Добавить(ВидПродукцииИСМП);
		КонецЕсли;
	КонецЦикла;
	
	Если ДоступныеВидыПродукции.Количество() < 2 Тогда
		Возврат ДоступныеВидыПродукции;
	КонецЕсли;
	
	ИмяДокумента = СтрРазделить(ПолноеИмяДокумента, ".")[1];
	Предзаполнение = Документы[ИмяДокумента].СоздатьДокумент();
	Предзаполнение.Заполнить(Ссылка);
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.МаркировкаТоваровИСМП")
		И ИнтеграцияИС.ЕстьРеквизитТабЧастиОбъекта("GTIN", Предзаполнение.Метаданные(), "Товары")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Операция") = Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков Тогда
		Товары = Предзаполнение.Товары.Выгрузить(, "Номенклатура, GTIN");
		ПараметрыЗаполненияПоКодамОстатков = Новый Структура;
		ПараметрыЗаполненияПоКодамОстатков.Вставить("Организация", Предзаполнение.Организация);
	Иначе
		Товары = Предзаполнение.Товары.Выгрузить(, "Номенклатура");
		Товары.Колонки.Добавить("GTIN", ОпределяемыеТипы().GTIN.Тип);
		ПараметрыЗаполненияПоКодамОстатков = Неопределено;
	КонецЕсли;
	
	Товары.Колонки.Добавить("Характеристика", ОпределяемыеТипы().ХарактеристикаНоменклатуры.Тип);
	
	Возврат ИнтеграцияИСМП.ВидыПродукцииПоТаблицеНоменклатуры(Товары, ПараметрыЗаполненияПоКодамОстатков);
	
КонецФункции

// 
// Параметры:
// 	Номенклатура - ОпределяемыйТип.Номенклатура - Номенклатура
// Возвращаемое значение:
// 	СправочникСсылка.ВидыАлкогольнойПродукции
//
Функция ВидПродукцииПоНоменклатуре(Номенклатура) Экспорт
	Возврат ИнтеграцияИС.ВидПродукцииПоНоменклатуре(Номенклатура);
КонецФункции

//Возвращает признак запроса данных из сервиса ИС МП.
//
//Возвращаемое значение:
//   Булево - Истина, в случае необходимости запроса данных сервиса.
//
Функция ЗапрашиватьДанныеСервиса() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ЗапрашиватьДанныеСервисаИСМП");

КонецФункции

// Возвращает признак необходимости контроля статусов кодов маркировок ИС МП.
//
//Параметры:
//	 ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции
//	 ВидОперации  - ПеречислениеСсылка.ВидыОперацийИСМП, Неопределено - Вид операции.
//	
// Возвращаемое значение:
//  Произвольный - Истина, в случае необходимости контроля статусов.
Функция КонтролироватьСтатусыКодовМаркировки(ВидПродукции = Неопределено, ВидОперации = Неопределено) Экспорт
	
	Возврат ИнтеграцияИСМПКлиентСерверПовтИсп.КонтролироватьСтатусыКодовМаркировки(ВидПродукции = Неопределено, ВидОперации = Неопределено);
	
КонецФункции

// Возвращает признак необходимости контроля статусов кодов маркировок при розничной торговле.
//
//Параметры:
//	 ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции
//	 ВидОперации  - ПеречислениеСсылка.ВидыОперацийИСМП, Неопределено - Вид операции.
// Возвращаемое значение:
//  Булево - Истина, в случае необходимости контроля статусов в рознице.
Функция КонтролироватьСтатусыКодовМаркировкиВРознице(ВидПродукции = Неопределено, ВидОперации = Неопределено) Экспорт
	
	Возврат ИнтеграцияИСМПКлиентСерверПовтИсп.КонтролироватьСтатусыКодовМаркировкиВРознице(ВидПродукции = Неопределено, ВидОперации = Неопределено);
	
КонецФункции

// Возвращает настройки сканирования кодов маркировки ИС МП.
//
// Возвращаемое значение:
//  Булево - Истина, в случае необходимости контроля статусов.
Функция НастройкиСканированияКодовМаркировки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЗапрашиватьДанныеСервисаИСМП", ПолучитьФункциональнуюОпцию("ЗапрашиватьДанныеСервисаИСМП"));
	Результат.Вставить("ПараметрыКонтроляСтатусов",    НастройкаПараметровСканированияСлужебныйКлиентСервер.НоваяГруппаПараметровНастройки());
	Результат.Вставить("ПараметрыКонтроляВладельцев",  НастройкаПараметровСканированияСлужебныйКлиентСервер.НоваяГруппаПараметровНастройки());
	
	Результат.Вставить("ПараметрыИгнорированияПроверкиККТ", НастройкаПараметровСканированияСлужебныйКлиентСервер.НоваяГруппаПараметровНастройки(Ложь));
	Результат.Вставить("РежимКонтроляСредствамиККТ",        "");
	Результат.Вставить("ПропускатьПроверкуСредствамиККТ",   Ложь);
	
	Результат.Вставить("КонтролироватьСтандартнуюВложенность",      Ложь);
	Результат.Вставить("ПропускатьСтрокиСОшибкамиПриЗагрузкеИзТСД", Истина);
	Результат.Вставить("ПроверятьАлфавитКодовМаркировки",           Истина);
	
	Результат.Вставить("ПроверятьСтруктуруКодовМаркировки", Истина);
	
	Результат.Вставить("КоличествоКодовВПакетеДляЗапросаСтатусов", 500);

	Результат.Вставить("СлужебныйШтрихкодПечатиУпаковки", "");
	// Табачная продукция
	Результат.Вставить("ПроверятьПотребительскиеУпаковкиНаВхождениеВСеруюЗонуМОТП",          Истина);
	Результат.Вставить("ПроверятьЛогистическиеИГрупповыеУпаковкиНаСодержаниеСерыхКодовМОТП", Истина);
	Результат.Вставить("УчитыватьМРЦ",                                                       Истина);
	Результат.Вставить("ДатаПроизводстваНачалаКонтроляСтатусовКодовМаркировкиМОТП",          ПроверкаИПодборПродукцииМОТПКлиентСервер.ДатаНачалаКонтроляКодовМаркировки());
	// Весовая продукция
	Результат.Вставить("ЗапрашиватьКоличествоМерногоТовара", Истина);
	
	// Разрешительный режим розничной продажи
	Результат.Вставить("ИспользоватьПроверкуРозничнымМетодомДляОпределенныхТоварныхГрупп", Истина); // устарела, не используется
	Результат.Вставить("ВремяБлокировкиCDNПлощадок",                                       15);     // в минутах
	Результат.Вставить("ВремяОтветаCDNПлощадокПриПробитииЧека",                            1.5);    // в секундах
	Результат.Вставить("ЧастотаОбновленияCDNПлощадок",                                     6);      // в часах
	Результат.Вставить("СрокДействияИдентификатораРазрешительногоРежима",                  300);    // в секундах
	Результат.Вставить("АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата",      Дата(1, 1, 1));
	
	УстановитьПривилегированныйРежим(Истина);
	ЗначениеКонстанты = Константы.НастройкиСканированияКодовМаркировкиИСМП.Получить().Получить();
	Если ТипЗнч(ЗначениеКонстанты) = Тип("Структура") Тогда
		
		ИсключаемыеСвойства = Новый Массив();
		
		Если ЗначениеКонстанты.Свойство("ПараметрыКонтроляСтатусов") Тогда
			
			ЗаполнитьЗначенияСвойств(Результат.ПараметрыКонтроляСтатусов, ЗначениеКонстанты.ПараметрыКонтроляСтатусов);
			УбратьОбязательныеТоварныеГруппыПриПродажеВРозницуИзИсключений(Результат.ПараметрыКонтроляСтатусов);
			ИсключаемыеСвойства.Добавить("ПараметрыКонтроляСтатусов");
			
		КонецЕсли;
		
		Если ЗначениеКонстанты.Свойство("ПараметрыКонтроляВладельцев") Тогда
			
			ЗаполнитьЗначенияСвойств(Результат.ПараметрыКонтроляВладельцев, ЗначениеКонстанты.ПараметрыКонтроляВладельцев);
			УбратьОбязательныеТоварныеГруппыПриПродажеВРозницуИзИсключений(Результат.ПараметрыКонтроляВладельцев);
			ИсключаемыеСвойства.Добавить("ПараметрыКонтроляВладельцев");
			
		КонецЕсли;
		
		Если ЗначениеКонстанты.Свойство("ПараметрыИгнорированияПроверкиККТ") Тогда
			ЗаполнитьЗначенияСвойств(Результат.ПараметрыИгнорированияПроверкиККТ, ЗначениеКонстанты.ПараметрыИгнорированияПроверкиККТ);
			ИсключаемыеСвойства.Добавить("ПараметрыИгнорированияПроверкиККТ");
		Иначе
			Если ЗначениеКонстанты.Свойство("ПараметрыКонтроляСредствамиККТ") Тогда
				Если ЗначениеКонстанты.ПараметрыКонтроляСредствамиККТ.Включено Тогда
					Если ЗначениеКонстанты.ПараметрыКонтроляСредствамиККТ.Исключения.Количество() Тогда
						ВключитьИгнорирование  = Ложь;
						ПараметрыКонтроля      = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ПараметрыКонтроля();
						ДопустимыеВидыОперации = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.ДопустимыеВидыОпераций(ПараметрыКонтроля.ПараметрыИгнорированияПроверкиККТ);
						Для Каждого КлючИЗначение Из ЗначениеКонстанты.ПараметрыКонтроляСредствамиККТ.Исключения Цикл
							ВидПродукции = КлючИЗначение.Ключ;
							Если КлючИЗначение.Значение.Количество() Тогда
								Для Каждого КлючИЗначениеОперация Из КлючИЗначение.Значение Цикл
									ВидОперации = КлючИЗначениеОперация.Ключ;
									Если ДопустимыеВидыОперации.НайтиПоЗначению(ВидОперации) <> Неопределено Тогда
										ВключитьИгнорирование = Истина;
										ОперацииПоВидуПродукции = Результат.ПараметрыИгнорированияПроверкиККТ.Исключения[ВидПродукции];
										Если ОперацииПоВидуПродукции = Неопределено Тогда
											ОперацииПоВидуПродукции = Новый Соответствие();
											Результат.ПараметрыИгнорированияПроверкиККТ.Исключения.Вставить(ВидПродукции, ОперацииПоВидуПродукции);
										КонецЕсли;
										ОперацииПоВидуПродукции.Вставить(ВидОперации, Истина);
									КонецЕсли;
								КонецЦикла;
							Иначе
								Результат.ПараметрыИгнорированияПроверкиККТ.Исключения.Вставить(ВидПродукции, Новый Соответствие());
							КонецЕсли;
						КонецЦикла;
						Результат.ПараметрыИгнорированияПроверкиККТ.Включено = ВключитьИгнорирование;
					КонецЕсли;
				Иначе
					Результат.ПараметрыИгнорированияПроверкиККТ.Включено = Истина;
				КонецЕсли;
				Если Результат.ПараметрыИгнорированияПроверкиККТ.Включено Тогда
					Результат.ПараметрыИгнорированияПроверкиККТ.ВариантОтображения = ЗначениеКонстанты.ПараметрыКонтроляСредствамиККТ.ВариантОтображения;
					Результат.ПропускатьПроверкуСредствамиККТ = Ложь;
					Если ЗначениеКонстанты.Свойство("ПропускатьПроверкуСредствамиККТ") Тогда
						ИсключаемыеСвойства.Добавить("ПропускатьПроверкуСредствамиККТ");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Результат, ЗначениеКонстанты,, СтрСоединить(ИсключаемыеСвойства, ","));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак включения режима работы с тестовым контуром ИС МП
//
// Возвращаемое значение:
//  Булево - Истина, если включен режим работы с тестовым контуром ИС МП.
//
Функция РежимРаботыСТестовымКонтуромИСМП() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("РежимРаботыСТестовымКонтуромИСМП");
	
КонецФункции

#КонецОбласти

#Область РазрешительныйРежимРозничнойПродажи

// Включает аварийный режим на определенное пользователем время;
// Аварийный режим подразумевает полное отключение запросов к ГИС МТ и розничную продажу
// отслеживаемых товарных групп без проверок разрешительного режима
// 
// Параметры:
//  СрокДействияВЧасах - Число - Срок включения аварийного режима в часах
Процедура ВключитьАварийныйРежимРазрешительнойСистемы(СрокДействияВЧасах) Экспорт
	
	ИнтеграцияИСМП.ВключитьАварийныйРежимРазрешительнойСистемы(СрокДействияВЧасах);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Отключает действие аварийного режима
// Действие разрешительного режима возобновляется в штатном режиме
//
Процедура ОтключитьАварийныйРежимРазрешительнойСистемы() Экспорт
	
	ИнтеграцияИСМП.ОтключитьАварийныйРежимРазрешительнойСистемы();
	
КонецПроцедуры

// Возвращает признак необходимости обновления списка CDN-площадок
// 
// Возвращаемое значение:
//  Булево - Истина, если все площадки обновлены ранее, чем указанное в настройках количество часов назад
Функция ПроверитьНеобходимостьОбновленияCDNПлощадок() Экспорт
	
	ТекущиеУчитываемыеТГОбязательнойОнлайнПроверки = СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницуНаДату();
	
	Если ТекущиеУчитываемыеТГОбязательнойОнлайнПроверки.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Истина КАК ЕстьАктуальныеПлощадки
		|ИЗ
		|	РегистрСведений.СостоянияCDNПлощадокИСМП КАК CDNПлощадкиИСМП
		|ГДЕ
		|	ДОБАВИТЬКДАТЕ(CDNПлощадкиИСМП.ДатаОбновленияУниверсальная, ЧАС,
		|		&ВремяОбновленияПлощадок) >= &ТекущаяУниверсальнаяДата";
	
	Запрос.УстановитьПараметр("ВремяОбновленияПлощадок",  ИнтеграцияИСМПКлиентСерверПовтИсп.ЧастотаОбновленияCDNПлощадок());
	Запрос.УстановитьПараметр("ТекущаяУниверсальнаяДата", ТекущаяУниверсальнаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// если результат пустой, все площадки просрочены. надо обновить
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

// Возвращает признак действия аварийного режима при розничных продажах
//  Запросы разрешительного режима не выполняются, их результаты не контролируются
// 
// Возвращаемое значение:
//  Булево - Истина, если аварийный режим включен
Функция ДействуетАварийныйРежимДляРозничныхПродаж() Экспорт
	
	НастройкиСканирования = НастройкиСканированияКодовМаркировки();
	ДатаДействияАварийногоРежима = НастройкиСканирования.АварийноеОтключенияРазрешительногоРежимаДоУниверсальнаяДата;
	
	Возврат ДатаДействияАварийногоРежима > ТекущаяУниверсальнаяДата();
	
КонецФункции

// Возвращает список учитываемых товарных групп для обязательной проверки разрешительного режима
//  при розничной продажи на конкретную дату
// 
// Параметры:
//  НаДату - Дата - дата проверки
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыПродукцииИС
Функция СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницуНаДату(НаДату = Неопределено) Экспорт
	
	Возврат РегистрыСведений.НастройкиУчетаМаркируемойПродукцииИСМП.СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницуНаДату(НаДату);
	
КонецФункции

// Возвращает список учитываемых товарных групп для обязательной проверки разрешительного режима
//  при розничной продажи
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ВидыПродукцииИС
Функция СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницу() Экспорт
	
	Возврат РегистрыСведений.НастройкиУчетаМаркируемойПродукцииИСМП.СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницу();
	
КонецФункции

#КонецОбласти

// Восстанавливает статус документа по данным протокола обмена.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - документ, по которому требуется восстановить статус.
//  СообщениеПрерывания - Строка, СправочникСсылка.ИСМППрисоединенныеФайлы - Сообщение на котором необходимо закончить процесс расчета статусов.
// Возвращаемое значение:
// 	ПеречислениеСсылка.СтатусыОбработкиВозвратаВОборотИСМП, ПеречислениеСсылка.СтатусыОбработкиСписанияКодовМаркировкиИСМП, ПеречислениеСсылка.СтатусыОбработкиЗаказовНаЭмиссиюКодовМаркировкиИСМП, ПеречислениеСсылка.СтатусыОбработкиПеремаркировкиТоваровИСМП, ПеречислениеСсылка.СтатусыОбработкиПриемкиТоваровИСМП, ПеречислениеСсылка.СтатусыОбработкиОтгрузкиТоваровИСМП, ПеречислениеСсылка.СтатусыОбработкиВыводаИзОборотаИСМП, ПеречислениеСсылка.СтатусыОбработкиМаркировкиТоваровИСМП - Рассчитанный статус.
Функция ВосстановитьСтатусДокументаПоДаннымПротоколаОбмена(ДокументСсылка, СообщениеПрерывания = Неопределено) Экспорт
	
	НаборПоДокументу = ИнтеграцияИСМП.РассчитатьСтатусДокументаПоДаннымПротоколаОбмена(ДокументСсылка,, СообщениеПрерывания);
	
	Возврат НаборПоДокументу[0].Статус;
	
КонецФункции

// Функция - Документы ИСМП по документу основанию
//
// Параметры:
//  ДокументОснование - ДокументСсылка - основание по которому надо получить документы ИСМП
// 
// Возвращаемое значение:
//  Структура - (см. ИнтеграцияИС.ДокументыИСПоДокументуОснованию)
//
Функция ДокументыИСМППоДокументуОснованию(ДокументОснование) Экспорт
	
	ДокументыИСМП = ИнтеграцияИС.ДокументыИСПоДокументуОснованию(
		ДокументОснование,
		Метаданные.РегистрыСведений.СтатусыДокументовИСМП);
	
	Возврат ДокументыИСМП;
	
КонецФункции

// Возвращает имена документов ИСМП, основанием для которых может являться указанный документ.
//
// Параметры:
//   ДокументОснование - ОпределяемыйТип.ОснованиеСтатусыОформленияДокументовИСМП - документ-основание для документа ИСМП
//
// Возвращаемое значение:
//   Массив из Строка - имена документов ИСМП
//
Функция ИменаДокументовДляДокументаОснования(ДокументОснование) Экспорт
	
	Возврат РасчетСтатусовОформленияИСМП.ИменаДокументовДляДокументаОснования(ДокументОснование);
	
КонецФункции

Функция АрхивироватьДокументы(ДокументыКАрхивированию) Экспорт
	
	Возврат РегистрыСведений.СтатусыДокументовИСМП.Архивировать(ДокументыКАрхивированию);
	
КонецФункции

// Архивирует (убирает из интерфейса к обработке) записи из регистра по переданным документам.
//
// Параметры:
//   Основания - Массив Из ОпределяемыйТип.ОснованиеСтатусыОформленияДокументовИСМП - массив распоряжений
//   Документ  - ОпределяемыйТип.ДокументыИСМППоддерживающиеСтатусыОформления - документ, данные по которому
//                                                                              необходимо архивировать.
//
Функция АрхивироватьРаспоряженияКОформлению(Основания, Документ) Экспорт
	
	Возврат РегистрыСведений.СтатусыОформленияДокументовИСМП.АрхивироватьРаспоряженияКОформлению(Основания, Документ);
	
КонецФункции

Функция ТекстНадписиПоляИнтеграцииВФормеДокументаОснования(Знач ДокументОснование) Экспорт
	
	ТекстНадписи = "";
	
	// Получим структуру вида ИмяДокументаИСМП - Статус
	СтатусыОформления = РегистрыСведений.СтатусыОформленияДокументовИСМП.СтатусыДокументовИСМППоДокументуОснованию(ДокументОснование);
	
	Если НЕ ЗначениеЗаполнено(СтатусыОформления) Тогда
		Возврат ТекстНадписи;
	КонецЕсли;
	
	// Получим структуру вида ИмяДокументаИСМП - Массив(ДокументыИСМПДанногоВида)
	ДокументыИСМП = ДокументыИСМППоДокументуОснованию(ДокументОснование);
	
	ТекстыНадписиПоДокументам = Новый Массив;
	
	Для Каждого КлючИЗначение Из СтатусыОформления Цикл
		
		МетаданныеДокумента = Метаданные.Документы[КлючИЗначение.Ключ];
		
		Если ИнтеграцияИС.РеквизитДокументОснованиеДокументаИС(МетаданныеДокумента).Тип.СодержитТип(ТипЗнч(ДокументОснование)) Тогда
			
			// Получим структуру с ключами "Представление, МассивДокументов, СтатусОформления, МетаданныеДокумента"
			Описание = ИнтеграцияИСМП.ОписаниеОформленныхДокументов(МетаданныеДокумента, ДокументОснование, ДокументыИСМП, СтатусыОформления);
			
			Если Описание = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекстыНадписиПоДокументам.Количество() > 0 Тогда
				ТекстыНадписиПоДокументам.Добавить(", ");
			КонецЕсли;
			
			ТекстыНадписиПоДокументам.Добавить(Описание.ТекстНадписи);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстНадписи = Новый ФорматированнаяСтрока(ТекстыНадписиПоДокументам);
	Возврат ТекстНадписи;
	
КонецФункции

// Получает ТН ВЭД
//
// Параметры:
//  КодТНВЭД - Строка - Код по классификатору товарной номенклатуры внешнеэкономической деятельности
//
// Возвращаемое значение:
//   Произвольный - элемент классификатора (если он определен в конфигурации)
//
Функция КлассификаторТНВЭДПоКоду(КодТНВЭД) Экспорт
	
	ТНВЭД = Неопределено;
	
	ИнтеграцияИСМППереопределяемый.КлассификаторТНВЭД(КодТНВЭД, ТНВЭД);
	
	Возврат ТНВЭД;
	
КонецФункции

Процедура ИзвлечьЛогЗапросовИзРезультатаОбмена(РезультатОбмена) Экспорт
	
	ДанныеЛогаЗапросов = ЛогированиеЗапросовИС.ДанныеЛогаЗапросовПоАдресуВременногоХранилища(РезультатОбмена.АдресДанныхЛогаЗапроса);
	
	ДанныеДляЗаписи = Новый Структура();
	ДанныеДляЗаписи.Вставить("ДанныеЛогаЗапросов", ДанныеЛогаЗапросов);
	
	ЛогированиеЗапросовИС.ДописатьВТекущийЛогДанныеИзФоновогоЗадания(
		ДанныеДляЗаписи,
		ЛогированиеЗапросовИСМП.ПараметрыЛогированияЗапросов());
	
КонецПроцедуры

Функция ИнформацияСертификатовНоменклатуры(СписокНоменклатуры) Экспорт
	
	СертификатыНоменклатуры = Новый Соответствие;
	ИнтеграцияИСПереопределяемый.ПриЗаполненииСертификатовНоменклатуры(СписокНоменклатуры, СертификатыНоменклатуры);
	
	Возврат СертификатыНоменклатуры;
	
КонецФункции

Функция ТребуетсяПерейтиВПул(Знач ДокументОснование) Экспорт
	
	Возврат Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ТребуетсяПерейтиВПул(ДокументОснование);
	
КонецФункции

Функция ОрганизацияЯвляетсяФермером(Организация) Экспорт
	
	КодОКОПФ = "";
	
	ИнтеграцияИСПереопределяемый.КодОКОПФОрганизации(КодОКОПФ, Организация);
	
	Возврат КодОКОПФ = "15300" Или КодОКОПФ = "50101" Или КодОКОПФ = "14100";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет структуру изменений по документу.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - документ, по которому требуется отменить передачу данных.
//  ЭлементОчереди - Неопределено,
//                   СтрокаТаблицыЗначений с колонками:
//                     Сообщение - ОпределяемыйТип.УникальныйИдентификаторИС - идентификатор сообщения.
//                     Операция - ПеречислениеСсылка.ВидыОперацийИСМП - операция.
//                     Организация - ОпределяемыйТип.Организация - организация.
//  ТекстОшибки - Строка.
//  НовыйСтатус - Неопределено.
// 
// Возвращаемое значение:
//  Массив из см. ИнтеграцияИСМПСлужебный.СтруктураИзменения()
Функция ЗаполнитьИзменения(ДокументСсылка, ЭлементОчереди = Неопределено, ТекстОшибки = "", НовыйСтатус = Неопределено)
	
	Изменения = Новый Массив;
	
	ДокументОснование = Неопределено;
	Если ДокументСсылка.Метаданные().Реквизиты.Найти("ДокументОснование") <> Неопределено Тогда
		ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ДокументОснование");
	КонецЕсли;
	
	СтрокаРезультата = ИнтеграцияИСМПСлужебный.СтруктураИзменения();
	СтрокаРезультата.Объект            = ДокументСсылка;
	СтрокаРезультата.ДокументОснование = ДокументОснование;
	СтрокаРезультата.НовыйСтатус       = НовыйСтатус;
	СтрокаРезультата.ТекстОшибки       = ТекстОшибки;
	
	Если ЭлементОчереди <> Неопределено Тогда
		СтрокаРезультата.Организация       = ЭлементОчереди.Организация;
		СтрокаРезультата.Операция          = ЭлементОчереди.Операция;
	КонецЕсли;
	
	Изменения.Добавить(СтрокаРезультата);
	
	Возврат Изменения;
	
КонецФункции

// см. ИнтеграцияИС.СертификатыПользователяДляПодписиПоОрганизации
Функция СертификатыПользователяДляПодписиПоОрганизации(Организация, ВключатьСертификатыФЛ = Ложь) Экспорт
	Возврат ИнтеграцияИС.СертификатыПользователяДляПодписиПоОрганизации(Организация, ВключатьСертификатыФЛ);
КонецФункции

Процедура УбратьОбязательныеТоварныеГруппыПриПродажеВРозницуИзИсключений(ПараметрыКонтроля)
	
	Если Не ТипЗнч(ПараметрыКонтроля) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПараметрыКонтроля.Свойство("Исключения") Тогда
		Возврат;
	КонецЕсли;
	
	СписокТоварныхГруппИсключений = 
		РегистрыСведений.НастройкиУчетаМаркируемойПродукцииИСМП.СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницуНаДату();
	
	Если ПараметрыКонтроля.ВариантОтображения = "ПоТоварнымГруппам" Тогда
		
		Для Каждого ТоварнаяГруппаИсключений Из СписокТоварныхГруппИсключений Цикл
			
			ИсключенияПоТГ = ПараметрыКонтроля.Исключения.Получить(ТоварнаяГруппаИсключений);
			
			Если ИсключенияПоТГ <> Неопределено Тогда
				
				Если ИсключенияПоТГ.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если ИсключенияПоТГ.Получить(Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа) <> Неопределено Тогда
					ИсключенияПоТГ.Удалить(Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа);
				КонецЕсли;
				
				Если ИсключенияПоТГ.Количество() = 0 Тогда
					ПараметрыКонтроля.Исключения.Удалить(ТоварнаяГруппаИсключений);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ПараметрыКонтроля.ВариантОтображения = "ПоОперациям" Тогда
		
		ИсключенияПоОперации = ПараметрыКонтроля.Исключения.Получить(Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа);
		
		Если ИсключенияПоОперации <> Неопределено Тогда
			
			Если ИсключенияПоОперации.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			Для Каждого ТоварнаяГруппаИсключений Из СписокТоварныхГруппИсключений Цикл
			
				Если ИсключенияПоОперации.Получить(ТоварнаяГруппаИсключений) <> Неопределено Тогда
					ИсключенияПоОперации.Удалить(ТоварнаяГруппаИсключений);
				КонецЕсли;
				
			КонецЦикла;
			
			Если ИсключенияПоОперации.Количество() = 0 Тогда
				ПараметрыКонтроля.Исключения.Удалить(Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа);
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
